Revit 2027 API
ParameterTypeId.DpartShapeModified Property
 "Shape is modified"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DpartShapeModified { get; }
Public Shared ReadOnly Property DpartShapeModified As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DpartShapeModified {
	ForgeTypeId^ get ();
}
static member DpartShapeModified : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace